let code = {
  0: "成功",
  // 用户模块
  1000: "token不正确，请重新登录",
  1001: "向用户管理系统发送请求出错",
  1002: "查找学生的老师发生错误",
  1003: "登录时更新用户缓存表出错",
  1004: "登录时插入新用户出错",
  1005: "查找用户信息出错",
  1006: "上传图片格式不正确",
  1007: "user_cache更新用户名字出错",
  1008: "服务器端保存图片出错",
  1009: "获取用户提问数出错",
  1010: "查询用户回答数出错",
  1011: "获取评论数出错",
  1012: "修改用户班级出错",
  1013: "读取图片信息出错",
  1014: "修改用户名插入记录出错",
  // 问题模块
  2001: "添加问题到数据库出错",
  2002: "删除问题出错",
  2003: "查找单个问题出错",
  2004: "查找单个问题的答案出错",
  2005: "查找问题答案个数出错",
  2006: "查找问题列表出错",
  2007: "添加回答出错",
  // 评价模块
  3001: "获取老师学生列表出错",
  3002: "添加评论到评论表出错",
  3003: "查询评论数和出错"
}

let codeMsg = function (num) {
  return code[num]
}

module.exports = codeMsg